; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite4 - satellite
	instrument12 - instrument
	instrument13 - instrument
	infrared5 - mode
	spectrograph1 - mode
	spectrograph2 - mode
	infrared4 - mode
	infrared3 - mode
	thermograph0 - mode
	Star4 - direction
	GroundStation1 - direction
	Star0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 infrared4)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared4)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared5)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 infrared5)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared5)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument6 infrared3)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 Star0)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 spectrograph2)
	(supports instrument8 infrared5)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 thermograph0)
	(supports instrument10 spectrograph2)
	(calibration_target instrument10 Star0)
	(supports instrument11 spectrograph1)
	(supports instrument11 infrared5)
	(supports instrument11 infrared4)
	(calibration_target instrument11 GroundStation2)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument12 spectrograph2)
	(supports instrument12 infrared4)
	(calibration_target instrument12 GroundStation3)
	(supports instrument13 spectrograph2)
	(calibration_target instrument13 GroundStation3)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon8)
)
(:goal (and
	(pointing satellite0 Phenomenon6)
	(pointing satellite2 Phenomenon8)
	(pointing satellite3 GroundStation3)
	(have_image Planet5 spectrograph2)
	(have_image Phenomenon6 spectrograph1)
	(have_image Star7 spectrograph2)
	(have_image Star7 infrared5)
	(have_image Phenomenon8 infrared3)
	(have_image Phenomenon8 thermograph0)
	(have_image Star9 spectrograph2)
))

)

; plan
1. (turn_to satellite2 star0 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star0)
   goals met: 1 of 10
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 1 of 10
3. (calibrate satellite2 instrument6 star0)
   added: (calibrated instrument6)
   goals met: 1 of 10
4. (turn_to satellite2 star9 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star9)
   goals met: 1 of 10
5. (take_image satellite2 star9 instrument6 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 2 of 10
6. (turn_to satellite2 star7 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star7)
   goals met: 2 of 10
7. (take_image satellite2 star7 instrument6 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 3 of 10
8. (turn_to satellite2 planet5 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet5)
   goals met: 3 of 10
9. (turn_to satellite0 groundstation3 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 10
10. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 3 of 10
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 10
12. (calibrate satellite1 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 3 of 10
13. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 3 of 10
14. (take_image satellite2 planet5 instrument6 spectrograph2)
   added: (have_image planet5 spectrograph2)
   goals met: 4 of 10
15. (turn_to satellite0 phenomenon8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 10
16. (take_image satellite0 phenomenon8 instrument1 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 5 of 10
17. (turn_to satellite0 phenomenon6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon6)
   goals met: 6 of 10
18. (take_image satellite0 phenomenon6 instrument1 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 7 of 10
19. (turn_to satellite1 star7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star7)
   goals met: 7 of 10
20. (take_image satellite1 star7 instrument4 infrared5)
   added: (have_image star7 infrared5)
   goals met: 8 of 10
21. (turn_to satellite2 phenomenon8 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 phenomenon8)
   goals met: 9 of 10
22. (take_image satellite2 phenomenon8 instrument6 infrared3)
   added: (have_image phenomenon8 infrared3)
   goals met: 10 of 10
